# ModuleStatus Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..ModuleStatus Property
MacroModule Class See Also
---
The module status.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ModuleStatus ModuleStatus { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ModuleStatus As ModuleStatus
	Get
```

Visual C++
---
```text
public:
property ModuleStatus ModuleStatus {
	ModuleStatus get ();
}
```

# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace